---
kind: other
id: Properties.T:Autodesk.Revit.DB.ShapeImporter
source: html/09187b66-03d4-9a7a-d847-757f768c034e.htm
---
# ShapeImporter Properties

The length unit to be used if not specified when the input is a unitless SAT file.